In [14]:
import pandas as pd
from pandas import Series, DataFrame
import numpy as np

In [2]:
obj = pd.Series([4, 7, -5, 3])

In [3]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [4]:
obj.values

array([ 4,  7, -5,  3])

In [5]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [6]:
obj2 = pd.Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])

In [7]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [8]:
obj2['a']

-5

In [9]:
obj2['d'] = 6

In [10]:
obj2

d    6
b    7
a   -5
c    3
dtype: int64

In [11]:
obj2[obj2 > 0]

d    6
b    7
c    3
dtype: int64

In [12]:
obj2 * 2

d    12
b    14
a   -10
c     6
dtype: int64

In [15]:
np.exp(obj2)

d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [16]:
'b' in obj2

True

In [17]:
'e' in obj2

False

In [18]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [19]:
obj3 = pd.Series(sdata)

In [20]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [21]:
states = ['California', 'Ohio', 'Oregon', 'Texas']

In [22]:
obj4 = pd.Series(sdata, index=states)

In [23]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [24]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [25]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [26]:
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [27]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [28]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [29]:
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [30]:
obj4.name = 'population'

In [31]:
obj4.index.name = 'state'

In [32]:
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [33]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [34]:
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']

In [35]:
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

In [37]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
       'year': [2000, 2001, 2002, 2001, 2002, 2003],
       'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)

In [38]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [39]:
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [41]:
pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'])

   year   state  pop debt
0  2000    Ohio  1.5  NaN
1  2001    Ohio  1.7  NaN
2  2002    Ohio  3.6  NaN
3  2001  Nevada  2.4  NaN
4  2002  Nevada  2.9  NaN
5  2003  Nevada  3.2  NaN

In [42]:
frame.year

0    2000
1    2001
2    2002
3    2001
4    2002
5    2003
Name: year, dtype: int64

In [43]:
frame['year']

0    2000
1    2001
2    2002
3    2001
4    2002
5    2003
Name: year, dtype: int64

In [47]:
frame.loc[1]

state    Ohio
year     2001
pop       1.7
Name: 1, dtype: object

In [48]:
frame['debt'] = 16.5

In [49]:
frame

    state  year  pop  debt
0    Ohio  2000  1.5  16.5
1    Ohio  2001  1.7  16.5
2    Ohio  2002  3.6  16.5
3  Nevada  2001  2.4  16.5
4  Nevada  2002  2.9  16.5
5  Nevada  2003  3.2  16.5

In [50]:
frame['debt'] = np.arange(6.)

In [51]:
frame

    state  year  pop  debt
0    Ohio  2000  1.5   0.0
1    Ohio  2001  1.7   1.0
2    Ohio  2002  3.6   2.0
3  Nevada  2001  2.4   3.0
4  Nevada  2002  2.9   4.0
5  Nevada  2003  3.2   5.0

In [52]:
val = pd.Series([-1.2, -1.5, -1,7], index=['two', 'four', 'five'])

ValueError: Length of passed values is 4, index implies 3.

In [53]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
      'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [54]:
frame3 = pd.DataFrame(pop)

In [55]:
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [56]:
frame3.T

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5

In [57]:
pd.DataFrame(pop, index=[2001, 2002, 2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [58]:
pdata = {'Ohio': frame3['Ohio'][:-1],
        'Nevada': frame3['Nevada'][:2]}

In [59]:
pd.DataFrame(pdata)

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9

In [60]:
frame3.index.name = 'year'; frame3.columns.name = 'state'

In [61]:
frame3

state  Nevada  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

In [62]:
frame3.values

array([[2.4, 1.7],
       [2.9, 3.6],
       [nan, 1.5]])

In [63]:
frame.values

array([['Ohio', 2000, 1.5, 0.0],
       ['Ohio', 2001, 1.7, 1.0],
       ['Ohio', 2002, 3.6, 2.0],
       ['Nevada', 2001, 2.4, 3.0],
       ['Nevada', 2002, 2.9, 4.0],
       ['Nevada', 2003, 3.2, 5.0]], dtype=object)

In [64]:
obj = pd.Series(range(3), index=['a', 'b', 'c'])

In [65]:
index = obj.index

In [66]:
index

Index(['a', 'b', 'c'], dtype='object')

In [67]:
index[1:]

Index(['b', 'c'], dtype='object')

In [68]:
index[1] = 'd'

TypeError: Index does not support mutable operations

In [69]:
labels = pd.Index(np.arange(3))

In [70]:
labels

Int64Index([0, 1, 2], dtype='int64')

In [72]:
obj2 = pd.Series([1.5, -2.5, 0], index=labels)

In [73]:
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [74]:
obj2.index is labels

True

In [75]:
frame3

state  Nevada  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

In [76]:
frame3.columns

Index(['Nevada', 'Ohio'], dtype='object', name='state')

In [77]:
'Ohio'in frame3.columns

True

In [78]:
2003 in frame3.index

False

In [80]:
dup_labels = pd.Index(['foo', 'foo', 'bar', 'bar'])

In [81]:
dup_labels

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')

In [82]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])

In [83]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [84]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])

In [85]:
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [86]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])

In [87]:
obj3

0      blue
2    purple
4    yellow
dtype: object

In [88]:
obj3.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [89]:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)),
                    index = ['a', 'c', 'd'],
                    columns=['Ohio', 'Texas', 'California'])

In [90]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [91]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'])

In [92]:
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [93]:
states = ['Texas', 'Utah', 'California']

In [94]:
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [96]:
frame.loc[['a', 'b', 'c', 'd'], states]

KeyError: 'Passing list-likes to .loc or [] with any missing labels is no longer supported, see https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#deprecate-loc-reindex-listlike'

In [97]:
obj = pd.Series(np.arange(5.), index=['a','b', 'c', 'd', 'e'])

In [98]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [99]:
new_obj = obj.drop('c')

In [101]:
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [102]:
obj.drop(['d', 'c'])

a    0.0
b    1.0
e    4.0
dtype: float64

In [103]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                   index = ['Ohio', 'Colorado', 'Utah', 'New York'],
                   columns = ['one', 'two', 'three', 'four'])

In [104]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [105]:
data.drop(['Colorado', 'Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [106]:
data.drop('two', axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [107]:
data.drop(['two', 'four'], axis='columns')

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [108]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [109]:
obj.drop('c', inplace=True)

In [110]:
obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [111]:
obj = pd.Series(np.arange(4.), index=['a', 'b', 'c','d'])

In [112]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [113]:
obj['b']

1.0

In [116]:
obj[['b', 'a', 'd']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [117]:
obj[[1, 3]]

b    1.0
d    3.0
dtype: float64

In [118]:
obj[obj < 2]

a    0.0
b    1.0
dtype: float64

In [119]:
obj['b':'c']

b    1.0
c    2.0
dtype: float64

In [120]:
obj['b':'c'] = 5

In [121]:
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [122]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four'])

In [123]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [124]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int64

In [125]:
data[['three', 'one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [126]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [127]:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [128]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [129]:
data[data < 5] = 0

In [130]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [131]:
data.loc['Colorado', ['two', 'three']]

two      5
three    6
Name: Colorado, dtype: int64

In [132]:
data.iloc[2, [3, 0, 1]]

four    11
one      8
two      9
Name: Utah, dtype: int64

In [133]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int64

In [134]:
data.iloc[[1, 2], [3, 0, 1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [135]:
data.loc[:'Utah', 'two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int64

In [136]:
data.iloc[:, :3][data.three > 5]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

In [137]:
ser = pd.Series(np.arange(3.))

In [138]:
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [139]:
ser2 = pd.Series(np.arange(3.), index=['a', 'b', 'c'])

In [140]:
ser2

a    0.0
b    1.0
c    2.0
dtype: float64

In [142]:
ser2[-1]

2.0

ser[:1]

In [143]:
ser.loc[:1]

0    0.0
1    1.0
dtype: float64

In [144]:
ser.iloc[:1]

0    0.0
dtype: float64

In [146]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])

In [147]:
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1], index=['a', 'c', 'e', 'f', 'g'])

In [148]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [149]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [150]:
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [151]:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'),
                  index=['Ohio', 'Texas', 'Colorado'])

In [152]:
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),
                  index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [153]:
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [154]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [155]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [156]:
df1 = pd.DataFrame({'A': [1, 2]})

In [157]:
df2 = pd.DataFrame({'B': [3, 4]})

In [158]:
df1

   A
0  1
1  2

In [159]:
df2

   B
0  3
1  4

In [160]:
df1 - df2

    A   B
0 NaN NaN
1 NaN NaN

In [161]:
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)),
                  columns=list('abcd'))

In [162]:
df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)),
                  columns=list('abcde'))

In [163]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [164]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [165]:
df2.loc[1, 'b'] = np.nan

In [166]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [167]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [168]:
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [169]:
1 / df1

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [170]:
df1.rdiv(1)

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [171]:
df1.reindex(columns=df2.columns, fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

In [172]:
arr = np.arange(12.).reshape((3, 4))

In [173]:
arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [174]:
arr[0]

array([0., 1., 2., 3.])

In [175]:
arr - arr[0]

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

In [181]:
frame = pd.DataFrame(np.arange(12.).reshape((4, 3)),
                    columns=list('bde'),
                    index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [182]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [184]:
series = frame.iloc[0]

In [185]:
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [186]:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [187]:
series2 = pd.Series(range(3), index=['b', 'e', 'f'])

In [188]:
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [189]:
series3 = frame['d']

In [190]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [191]:
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [192]:
frame.sub(series3, axis='index')

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

In [193]:
frame = pd.DataFrame(np.random.randn(4, 3), columns=list('bde'),
                    index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [194]:
frame

               b         d         e
Utah   -1.139320  0.639871 -2.264536
Ohio    1.665914  0.763171 -0.357981
Texas   0.333860  1.611933  0.216586
Oregon  0.174316 -0.384867  0.492933

In [195]:
np.abs(frame)

               b         d         e
Utah    1.139320  0.639871  2.264536
Ohio    1.665914  0.763171  0.357981
Texas   0.333860  1.611933  0.216586
Oregon  0.174316  0.384867  0.492933

In [196]:
f = lambda x: x.max() - x.min()

In [197]:
frame.apply(f)

b    2.805234
d    1.996800
e    2.757470
dtype: float64

In [198]:
frame.apply(f, axis='columns')

Utah      2.904407
Ohio      2.023895
Texas     1.395347
Oregon    0.877801
dtype: float64

In [202]:
s1 = pd.Series(np.random.randn(6), index=list('abcdef'))

In [203]:
s1

a    2.358127
b   -0.520941
c   -0.651461
d   -0.696615
e   -2.717960
f   -0.008398
dtype: float64

In [204]:
df1 = pd.DataFrame(np.random.randn(6, 4),
                  index=list('abcdef'),
                  columns=list('ABCD'))

In [205]:
df1

          A         B         C         D
a -1.219927  0.208068 -1.201478  0.441284
b -0.856395 -0.176929 -1.025651 -1.177443
c -0.073418  0.238098  0.608379 -0.390382
d -1.148015  3.037161 -0.641414 -0.024002
e -0.897441  0.171892 -1.622904  0.605734
f -0.939119 -0.516983 -0.439784  1.956235

In [206]:
obj = pd.Series(range(4), index=['d', 'a', 'b', 'c'])

In [207]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [208]:
frame = pd.DataFrame(np.arange(8).reshape((2, 4)),
                    index=['three', 'one'],
                    columns=['d', 'a', 'b', 'c'])

In [209]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [210]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [211]:
frame.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [212]:
obj = pd.Series([4, 7, -3, 2])

In [213]:
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [214]:
obj = pd.Series([4, np.nan, 7, np.nan, -3, 2])

In [215]:
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [216]:
frame = pd.DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})

In [217]:
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [218]:
frame.sort_values(by='b')

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [221]:
frame.sort_values(by=['a', 'b'])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [222]:
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])

In [223]:
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [224]:
obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [225]:
obj.rank(ascending=False, method='max')

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [226]:
frame = pd.DataFrame({'b': [4.3, 7, -3, 2], 'a': [0, 1, 0, 1],
                     'c': [-2, 5, 8, -2.5]})

In [227]:
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [228]:
frame.rank(axis='columns')

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

In [229]:
obj = pd.Series(range(5), index=['a', 'a', 'b', 'b', 'c'])

In [230]:
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [231]:
obj.index.is_unique

False

In [232]:
obj['a']

a    0
a    1
dtype: int64

In [233]:
obj['c']

4

In [234]:
df = pd.DataFrame(np.random.randn(4, 3), index=['a', 'a', 'b', 'b'])

In [235]:
df

          0         1         2
a -0.402676  0.402024  1.256762
a -0.421697 -0.419129  0.281610
b -1.204030 -0.909416 -0.015165
b  0.777021 -0.420659 -1.165693

In [237]:
df.loc['b']

          0         1         2
b -1.204030 -0.909416 -0.015165
b  0.777021 -0.420659 -1.165693

In [238]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],
                  [np.nan, np.nan], [0.75, -1.3]],
                 index=['a', 'b', 'c', 'd'],
                 columns=['one', 'two'])

In [239]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [240]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [241]:
df.sum(axis='columns')

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [242]:
df.mean(axis='columns', skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [244]:
df.idxmax()

one    b
two    d
dtype: object

In [245]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [246]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [247]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [248]:
obj = pd.Series(['a', 'a', 'b', 'c'] * 4)

In [250]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

In [251]:
df.count()

one    3
two    2
dtype: int64

In [252]:
import pandas_datareader.data as web

In [253]:
all_data= {ticker: web.get_data_yahoo(ticker)
          for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']}

In [255]:
price = pd.DataFrame({ticker: data['Adj Close']
                     for ticker, data in all_data.items()})

In [256]:
volume = pd.DataFrame({ticker: data['Volume']
                      for ticker, data in all_data.items()})

In [257]:
returns = price.pct_change()

In [258]:
returns.tail()

                AAPL       IBM      MSFT      GOOG
Date
2020-08-25 -0.008204 -0.008275  0.013009  0.012605
2020-08-26  0.013599 -0.003771  0.021620  0.027459
2020-08-27 -0.011954  0.003866  0.024554 -0.010924
2020-08-28 -0.001620  0.003369  0.010283  0.006168
2020-08-31  0.033912 -0.014072 -0.014766 -0.006221

In [260]:
returns['MSFT'].corr(returns['IBM'])

0.579647487867962

returns['MSFT'].cov(returns['IBM'])

In [261]:
returns.MSFT.corr(returns.IBM)

0.579647487867962

In [262]:
returns.corr()

          AAPL       IBM      MSFT      GOOG
AAPL  1.000000  0.505937  0.697897  0.654234
IBM   0.505937  1.000000  0.579647  0.533730
MSFT  0.697897  0.579647  1.000000  0.780568
GOOG  0.654234  0.533730  0.780568  1.000000

In [263]:
returns.cov()

          AAPL       IBM      MSFT      GOOG
AAPL  0.000335  0.000148  0.000221  0.000196
IBM   0.000148  0.000256  0.000160  0.000140
MSFT  0.000221  0.000160  0.000299  0.000221
GOOG  0.000196  0.000140  0.000221  0.000268

In [264]:
returns.corrwith(returns.IBM)

AAPL    0.505937
IBM     1.000000
MSFT    0.579647
GOOG    0.533730
dtype: float64

In [265]:
returns.corrwith(volume)

AAPL   -0.081693
IBM    -0.099526
MSFT   -0.046839
GOOG   -0.147543
dtype: float64

In [266]:
obj = pd.Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])

In [267]:
uniques = obj.unique()

In [268]:
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [269]:
obj.value_counts()

a    3
c    3
b    2
d    1
dtype: int64

In [270]:
pd.value_counts(obj.values, sort=False)

b    2
c    3
d    1
a    3
dtype: int64

In [271]:
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [272]:
mask = obj.isin(['b', 'c'])

In [273]:
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [274]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [275]:
to_match = pd.Series(['c', 'a', 'b', 'b', 'c', 'a'])

In [276]:
unique_vals = pd.Series(['c', 'b', 'a'])

In [277]:
pd.Index(unique_vals).get_indexer(to_match)

array([0, 2, 1, 1, 0, 2])

In [278]:
data = pd.DataFrame({'Qu1': [1, 3, 4, 3, 4],
                    'Qu2': [2, 3, 1, 2, 3],
                    'Qu3': [1, 5, 2, 4, 4]})

In [279]:
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [280]:
result = data.apply(pd.value_counts).fillna(0)

In [281]:
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

In [283]:
!cat przyklady/ex1.csv

cat: przyklady/ex1.csv: No such file or directory

In [285]:
df = pd.read_csv('/Users/karolkul/temp/pytand/przyklady/ex1.csv')

In [286]:
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [287]:
pd.read_table('/Users/karolkul/temp/pytand/przyklady/ex1.csv', sep=',')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [288]:
!cat /Users/karolkul/temp/pytand/przyklady/ex2.csv

1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [289]:
pd.read_csv('/Users/karolkul/temp/pytand/przyklady/ex2.csv', header=None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [290]:
pd.read_csv('/Users/karolkul/temp/pytand/przyklady/ex1.csv', names=['a', 'b', 'c', 'd', 'message'])

   a   b   c   d  message
0  a   b   c   d  message
1  1   2   3   4    hello
2  5   6   7   8    world
3  9  10  11  12      foo

In [291]:
names = ['a', 'b', 'c', 'd', 'message']

In [292]:
pd.read_csv('/Users/karolkul/temp/pytand/przyklady/ex1.csv', names=names, index_col='message')

         a   b   c   d
message
message  a   b   c   d
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [293]:
!cat /Users/karolkul/temp/pytand/przyklady/csv_mindex.csv

key1,key2,value1,value2
one,a,1,2
one,b,3,4
one,c,5,6
one,d,7,8
two,a,9,10
two,b,11,12
two,c,13,14
two,d,15,16

In [295]:
parsed = pd.read_csv('/Users/karolkul/temp/pytand/przyklady/csv_mindex.csv',
                    index_col=['key1', 'key2'])

In [296]:
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [297]:
list(open('/Users/karolkul/temp/pytand/przyklady/ex3.txt'))

['            A         B         C\n',
 'aaa -0.264438 -1.026059 -0.619500\n',
 'bbb  0.927272  0.302904 -0.032399\n',
 'ccc -0.264273 -0.386314 -0.217601\n',
 'ddd -0.871858 -0.348382  1.100491\n']

In [298]:
result = pd.read_table('/Users/karolkul/temp/pytand/przyklady/ex3.csv', sep='\s+')

In [299]:
result

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [300]:
!cat /Users/karolkul/temp/pytand/przyklady/ex4.csv

# Cześć!
a,b,c,d,message
# Chciałem tylko trochę utrudnić Twoją pracę.
# Kto w ogóle wczytuje pliki CSV za pomocą komputera?
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [306]:
pd.read_csv('/Users/karolkul/temp/pytand/przyklady/ex4.csv', skiprows=[0, 2, 3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [307]:
!cat /Users/karolkul/temp/pytand/przyklady/ex5.csv

something,a,b,c,d,message
one,1,2,3,4,NA
two,5,6,,8,world
three,9,10,11,12,foo

In [309]:
result = pd.read_csv('/Users/karolkul/temp/pytand/przyklady/ex5.csv')

In [310]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [311]:
pd.isnull(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [312]:
result = pd.read_csv('/Users/karolkul/temp/pytand/przyklady/ex5.csv', na_values=['NULL'])

In [313]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [314]:
sentinels = {'message': ['foo', 'NA'], 'something': ['two']}

In [315]:
pd.read_csv('/Users/karolkul/temp/pytand/przyklady/ex5.csv', na_values=sentinels)

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

In [316]:
pd.options.display.max_rows = 10

In [318]:
result = pd.read_csv('/Users/karolkul/temp/pytand/przyklady/ex6.csv')

In [319]:
result

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

In [321]:
pd.read_csv('/Users/karolkul/temp/pytand/przyklady/ex6.csv', nrows=5)

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

In [322]:
chunker = pd.read_csv('/Users/karolkul/temp/pytand/przyklady/ex6.csv', chunksize=1000)

In [323]:
chunker

In [324]:
tot = pd.Series([])
for piece in chunker:
    tot = tot.add(piece['key'].value_counts(), fill_value=0)
    
tot = tot.sort_values(ascending=False)

<ipython-input-324-03faebcbae4e>:1: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  tot = pd.Series([])

In [325]:
tot[:10]

E    368.0
X    364.0
L    346.0
O    343.0
Q    340.0
M    338.0
J    337.0
F    335.0
K    334.0
H    330.0
dtype: float64

In [326]:
data = pd.read_csv('/Users/karolkul/temp/pytand/przyklady/ex5.csv')

In [327]:
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [328]:
data.to_csv('/Users/karolkul/temp/pytand/przyklady/out.csv')

In [329]:
!cat /Users/karolkul/temp/pytand/przyklady/out.csv

,something,a,b,c,d,message
0,one,1,2,3.0,4,
1,two,5,6,,8,world
2,three,9,10,11.0,12,foo

In [330]:
import sys

In [331]:
data.to_csv(sys.stdout, sep='|')

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

In [332]:
data.to_csv(sys.stdout, na_rep='NULL')

,something,a,b,c,d,message
0,one,1,2,3.0,4,NULL
1,two,5,6,NULL,8,world
2,three,9,10,11.0,12,foo

In [333]:
data.to_csv(sys.stdout, index=False, header=False)

one,1,2,3.0,4,
two,5,6,,8,world
three,9,10,11.0,12,foo

In [334]:
data.to_csv(sys.stdout, index=False, columns=['a', 'b', 'c'])

a,b,c
1,2,3.0
5,6,
9,10,11.0

In [335]:
dates = pd.date_range('1/1/2000', periods=7)

In [336]:
ts = pd.Series(np.arange(7), index=dates)

In [337]:
ts.to_csv('/Users/karolkul/temp/pytand/przyklady/tseries.csv')

In [338]:
!cat /Users/karolkul/temp/pytand/przyklady/tseries.csv

,0
2000-01-01,0
2000-01-02,1
2000-01-03,2
2000-01-04,3
2000-01-05,4
2000-01-06,5
2000-01-07,6

In [339]:
!cat /Users/karolkul/temp/pytand/przyklady/ex7.csv

"a","b","c"
"1","2","3"
"1","2","3"

In [340]:
import csv

In [341]:
f = open('/Users/karolkul/temp/pytand/przyklady/ex7.csv')

In [342]:
reader = csv.reader(f)

In [343]:
for line in reader:
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [345]:
with open('/Users/karolkul/temp/pytand/przyklady/ex7.csv') as f:
    lines = list(csv.reader(f))

In [346]:
header, values = lines[0], lines[1]

In [347]:
data_dict = {h: v for h, v in zip(header, zip(*values))}

In [348]:
data_dict

{'a': ('1', '2', '3')}

In [349]:
class my_dialect(csv.Dialect):
    lineterminator = '\n'
    delimiter = ';'
    quotechar = '"'
    quoting = csv.QUOTE_MINIMAL

In [352]:
reader = csv.reader(f, Dialect=my_dialect)

TypeError: argument 1 must be an iterator

In [351]:
reader = csv.reader(f, delimiter='|')

TypeError: argument 1 must be an iterator

In [353]:
with open('mydata.csv', 'w') as f:
    writer = csv.writer(f, dialect=my_dialect)
    writer.writerow(('one', 'two', 'three'))
    writer.writerow(('1', '2', '3'))
    writer.writerow(('4', '5', '6'))
    writer.writerow(('7', '8', '9'))

In [354]:
!cat mydata.csv

one;two;three
1;2;3
4;5;6
7;8;9

In [355]:
import json

In [359]:
obj = """
{"name": "Wes",
"places_lived": ["United States", "Spain", "Germany"],
"pet": null,
"siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},
            {"name": "Katie", "age": 38,
            "pets": ["Sixes", "Stache", "Cisco"]}]
}
"""

In [361]:
result = json.loads(obj)

In [362]:
result

{'name': 'Wes',
 'places_lived': ['United States', 'Spain', 'Germany'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zuko']},
  {'name': 'Katie', 'age': 38, 'pets': ['Sixes', 'Stache', 'Cisco']}]}

In [363]:
asjson = json.dumps(result)

In [364]:
siblings = pd.DataFrame(result['siblings'], columns=['name', 'age'])

In [365]:
siblings

    name  age
0  Scott   30
1  Katie   38

In [366]:
!cat /Users/karolkul/temp/pytand/przyklady/example.json

[{"a": 1, "b": 2, "c": 3},
 {"a": 4, "b": 5, "c": 6},
 {"a": 7, "b": 8, "c": 9}]

In [367]:
data = pd.read_json('/Users/karolkul/temp/pytand/przyklady/example.json')

In [368]:
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [369]:
tables = pd.read_html('/Users/karolkul/temp/pytand/przyklady/fdic_failed_bank_list.html')

In [370]:
len(tables)

1

In [371]:
failures = tables[0]

In [372]:
failures.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","November 17, 2016"
1,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","November 17, 2016"
2,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","September 6, 2016"
3,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","September 6, 2016"
4,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","June 16, 2016"

In [373]:
close_timestamps = pd.to_datetime(failures['Closing Date'])

In [375]:
close_timestamps.dt.year.value_counts()

2010    157
2009    140
2011     92
2012     51
2008     25
       ...
2004      4
2001      4
2007      3
2003      3
2000      2
Name: Closing Date, Length: 15, dtype: int64

In [376]:
from lxml import objectify

In [380]:
path = '/Users/karolkul/temp/pytand/Dane/mta_perf/Performance_MNR.xml'
parsed = objectify.parse(open(path))

In [381]:
root = parsed.getroot()

In [382]:
data = []

In [383]:
skip_fields = ['PARENT_SEQ', 'INDICATOR_SEQ',
              'DESIRED_CHANGE', 'DECIMAL_PLACES']

In [384]:
for elt in root.INDICATOR:
    el_data = {}
    for child in elt.getchildren():
        if child.tag in skip_fields:
            continue
        el_data[child.tag] = child.pyval
    data.append(el_data)

In [385]:
perf = DataFrame(data)

In [386]:
perf.head()

,AGENCY_NAME,INDICATOR_NAME,DESCRIPTION,PERIOD_YEAR,PERIOD_MONTH,CATEGORY,FREQUENCY,INDICATOR_UNIT,YTD_TARGET,YTD_ACTUAL,MONTHLY_TARGET,MONTHLY_ACTUAL
0,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,1,Service Indicators,M,%,95,96.9,95,96.9
1,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,2,Service Indicators,M,%,95,96,95,95
2,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,3,Service Indicators,M,%,95,96.3,95,96.9
3,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,4,Service Indicators,M,%,95,96.8,95,98.3
4,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,5,Service Indicators,M,%,95,96.6,95,95.8

In [387]:
from io import StringIO

In [388]:
tag = '<a href="http://www.google.com">Google</a>'
root = objectify.parse(StringIO(tag)).getroot()

In [389]:
root

In [390]:
root.get('href')

'http://www.google.com'

In [391]:
root.text

'Google'

In [392]:
frame = pd.read_csv('/Users/karolkul/temp/pytand/przyklady/ex1.csv')

In [393]:
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [395]:
frame.to_pickle('/Users/karolkul/temp/pytand/przyklady/frame_pickle')

In [396]:
pd.read_pickle('/Users/karolkul/temp/pytand/przyklady/frame_pickle')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [397]:
frame = pd.DataFrame({'a': np.random.randn(100)})

In [399]:
store = pd.HDFStore('mydata.h5')

In [400]:
store['obj1'] = frame

In [401]:
store['obj1_col'] = frame['a']

In [402]:
store

<class 'pandas.io.pytables.HDFStore'>
File path: mydata.h5

In [403]:
frame

           a
0   0.894181
1  -1.841339
2  -1.076646
3  -0.234567
4   1.066456
..       ...
95  0.021480
96 -0.551403
97  0.243617
98 -1.317159
99  0.184013

[100 rows x 1 columns]

In [404]:
store

<class 'pandas.io.pytables.HDFStore'>
File path: mydata.h5

In [405]:
store['obj1']

           a
0   0.894181
1  -1.841339
2  -1.076646
3  -0.234567
4   1.066456
..       ...
95  0.021480
96 -0.551403
97  0.243617
98 -1.317159
99  0.184013

[100 rows x 1 columns]

In [407]:
store.put('obj2', frame, format='table')

In [408]:
store.select('obj2', where=['index >= 10 and index <= 15'])

           a
10  0.924225
11 -0.376809
12  0.566644
13 -0.741632
14  0.258946
15  0.055526

In [409]:
store.close()

In [410]:
frame.to_hdf('mydata.h5', 'obj3', format='table')

In [411]:
pd.read_hdf('mydata.h5', 'obj3', where=['index < 5'])

          a
0  0.894181
1 -1.841339
2 -1.076646
3 -0.234567
4  1.066456

In [412]:
xlsx = pd.ExcelFile('/Users/karolkul/temp/pytand/przyklady/ex1.xlsx')

In [413]:
pd.read_excel(xlsx, 'Sheet1')

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [414]:
frame = pd.read_excel('/Users/karolkul/temp/pytand/przyklady/ex1.xlsx', 'Sheet1')

In [415]:
frame

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [416]:
writer = pd.ExcelWriter('/Users/karolkul/temp/pytand/przyklady/ex2.xlsx')

In [417]:
frame.to_excel(writer, 'Sheet1')

In [418]:
writer.save()

In [419]:
frame.to_excel('/Users/karolkul/temp/pytand/przyklady/ex2.xlsx')

In [420]:
import requests

In [421]:
url = 'https://api.github.com/repos/pandas-dev/pandas/issues'

In [422]:
resp = requests.get(url)

In [423]:
resp

In [424]:
data = resp.json()

In [425]:
data[0]['title']

'BUG: isin has unexpected behavirour when using a dataframe with a large amout of rows (1.000.001)'

In [426]:
issues = pd.DataFrame(data, columns=['number', 'title',
                                    'labels', 'state'])

In [427]:
issues

,number,title,labels,state
0,36066,BUG: isin has unexpected behavirour when using...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
1,36065,BUG: Index.equals returns incorrect result,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
2,36064,BUG: Scatterplot x-axis label disappears with ...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
3,36063,BUG: Unary minus raises for series with Int64D...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
4,36062,"QST: CSV: export, import and new lines","[{'id': 1954720290, 'node_id': 'MDU6TGFiZWwxOT...",open
...,...,...,...,...
25,36033,Coverting bug by null values from csv into pan...,"[{'id': 307649777, 'node_id': 'MDU6TGFiZWwzMDc...",open
26,36032,BUG: .dt.isocalendar().year,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
27,36031,BUG: Mean of zeros turn out to be non-zero,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
28,36030,BUG: wrong plotting in x-axis when index set t...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
29,36019,BUG: Read_Parquet replacing values with None,"[{'id': 685114413, 'node_id': 'MDU6TGFiZWw2ODU...",open

In [428]:
import sqlite3

In [429]:
query = """
CREATE TABLE test
(a VARCHAR(20), b VARCHAR(20),
c REAL, d INTEGER
);"""

In [430]:
con = sqlite3.connect('mydata.sqlite')

In [431]:
con.execute(query)

In [432]:
con.commit()

In [433]:
data = [('Atlanta', 'Georgia', 1.25, 6),
       ('Tallahassee', 'Florida', 2.6, 3),
       ('Sacramento', 'California', 1.7, 5)]

In [435]:
stmt = "INSERT INTO test VALUES(?, ?, ?, ?)"

In [436]:
con.executemany(stmt, data)

In [437]:
con.commit()

In [438]:
cursor = con.execute('select * from test')

In [439]:
rows = cursor.fetchall()

In [440]:
rows

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5)]

In [441]:
cursor.description

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

In [442]:
pd.DataFrame(rows, columns=[x[0] for x in cursor.description])

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5

In [444]:
import sqlalchemy as sqla

In [445]:
db = sqla.create_engine('sqlite:///mydata.sqlite')

In [446]:
pd.read_sql('select * from test', db)

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5

In [447]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])

In [448]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [450]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [451]:
string_data[0] = None

In [452]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [453]:
from numpy import nan as NA

In [454]:
data = pd.Series([1, NA, 3.5, NA, 7])

In [455]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [456]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [457]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
                    [NA, NA, NA], [NA, 6.5, 3.]])

In [458]:
cleaned = data.dropna()

In [459]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [460]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [461]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [462]:
data[4] = NA

In [463]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [464]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [469]:
df = pd.DataFrame(np.random.randn(7, 3))

In [470]:
df.iloc[:4, 1] = NA

In [471]:
df.iloc[:2, 2] = NA

In [472]:
df

          0         1         2
0  0.532234       NaN       NaN
1  0.002700       NaN       NaN
2 -0.809157       NaN  0.379229
3  0.027203       NaN -0.903975
4 -0.607243 -0.671129 -1.296785
5  1.446428 -0.839865 -0.236241
6 -0.858839  1.748835 -1.695094

In [473]:
df.dropna()

          0         1         2
4 -0.607243 -0.671129 -1.296785
5  1.446428 -0.839865 -0.236241
6 -0.858839  1.748835 -1.695094

In [474]:
df.dropna(thresh=2)

          0         1         2
2 -0.809157       NaN  0.379229
3  0.027203       NaN -0.903975
4 -0.607243 -0.671129 -1.296785
5  1.446428 -0.839865 -0.236241
6 -0.858839  1.748835 -1.695094

In [475]:
df.fillna(0)

          0         1         2
0  0.532234  0.000000  0.000000
1  0.002700  0.000000  0.000000
2 -0.809157  0.000000  0.379229
3  0.027203  0.000000 -0.903975
4 -0.607243 -0.671129 -1.296785
5  1.446428 -0.839865 -0.236241
6 -0.858839  1.748835 -1.695094

In [476]:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0  0.532234  0.500000  0.000000
1  0.002700  0.500000  0.000000
2 -0.809157  0.500000  0.379229
3  0.027203  0.500000 -0.903975
4 -0.607243 -0.671129 -1.296785
5  1.446428 -0.839865 -0.236241
6 -0.858839  1.748835 -1.695094

In [477]:
_ = df.fillna(0, inplace=True)

In [478]:
df

          0         1         2
0  0.532234  0.000000  0.000000
1  0.002700  0.000000  0.000000
2 -0.809157  0.000000  0.379229
3  0.027203  0.000000 -0.903975
4 -0.607243 -0.671129 -1.296785
5  1.446428 -0.839865 -0.236241
6 -0.858839  1.748835 -1.695094

In [479]:
df = pd.DataFrame(np.random.randn(6, 3))

In [480]:
df.iloc[2:, 1] = NA

In [481]:
df.iloc[4:, 2] = NA

In [482]:
df

          0         1         2
0 -2.018743  0.177405  0.448003
1 -1.176271 -0.043331  0.522796
2 -0.839383       NaN  1.760323
3  0.302232       NaN -0.388120
4 -1.082085       NaN       NaN
5 -0.563118       NaN       NaN

In [483]:
df.fillna(method='ffill')

          0         1         2
0 -2.018743  0.177405  0.448003
1 -1.176271 -0.043331  0.522796
2 -0.839383 -0.043331  1.760323
3  0.302232 -0.043331 -0.388120
4 -1.082085 -0.043331 -0.388120
5 -0.563118 -0.043331 -0.388120

In [484]:
df.fillna(method='ffill', limit=2)

          0         1         2
0 -2.018743  0.177405  0.448003
1 -1.176271 -0.043331  0.522796
2 -0.839383 -0.043331  1.760323
3  0.302232 -0.043331 -0.388120
4 -1.082085       NaN -0.388120
5 -0.563118       NaN -0.388120

In [485]:
data = pd.Series([1., NA, 3.5, NA, 7])

In [486]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [487]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                    'k2': [1, 1, 2, 3, 3, 4, 4]})

In [488]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [489]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [490]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [492]:
data['v1'] = range(7)

In [493]:
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [494]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [495]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [496]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
                             'Pastrami', 'corned beef', 'Bacon',
                             'pastrami', 'honey ham', 'nova lox'],
                    'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [497]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [498]:
meat_to_animal = {
    'bacon': 'pig',
    'pulled pork': 'pig',
    'pastrami': 'cow',
    'corned beef': 'cow',
    'honey ham': 'pig',
    'nova lox': 'salmon'
}

In [499]:
lowercased = data['food'].str.lower()

In [500]:
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [501]:
data['animal'] = lowercased.map(meat_to_animal)

In [502]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [503]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [504]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])

In [505]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [506]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [507]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [508]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [509]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [510]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                   index=['Ohio', 'Colorado', 'New York'],
                   columns=['one', 'two', 'three', 'four'])

In [511]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [513]:
transform = lambda x: x[:4].upper()

In [514]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [515]:
data.index = data.index.map(transform)

In [516]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [520]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [518]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [521]:
data.rename(index={'OHIO': 'INDIANA'},
           columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [522]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [523]:
data.rename(index={'OHIO': 'INDIANA'}, inplace=True)

In [524]:
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

In [525]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [526]:
bins = [18, 25, 35, 60,100]

In [527]:
cats = pd.cut(ages, bins)

In [528]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [529]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [530]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [531]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [532]:
pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [533]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']

In [534]:
pd.cut(ages, bins, labels=group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

In [535]:
data = np.random.rand(20)

In [537]:
pd.cut(data, 4, precision=3)

[(0.499, 0.719], (0.279, 0.499], (0.499, 0.719], (0.719, 0.94], (0.499, 0.719], ..., (0.0573, 0.279], (0.279, 0.499], (0.0573, 0.279], (0.0573, 0.279], (0.0573, 0.279]]
Length: 20
Categories (4, interval[float64]): [(0.0573, 0.279] < (0.279, 0.499] < (0.499, 0.719] < (0.719, 0.94]]

In [538]:
data = np.random.randn(1000)

In [539]:
cats = pd.qcut(data, 4)

In [540]:
cats

[(0.0445, 0.686], (-2.977, -0.665], (-0.665, 0.0445], (0.686, 4.033], (0.686, 4.033], ..., (-2.977, -0.665], (-0.665, 0.0445], (-0.665, 0.0445], (0.0445, 0.686], (0.686, 4.033]]
Length: 1000
Categories (4, interval[float64]): [(-2.977, -0.665] < (-0.665, 0.0445] < (0.0445, 0.686] < (0.686, 4.033]]

In [541]:
pd.value_counts(cats)

(0.686, 4.033]      250
(0.0445, 0.686]     250
(-0.665, 0.0445]    250
(-2.977, -0.665]    250
dtype: int64

In [542]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])

[(0.0445, 1.226], (-1.196, 0.0445], (-1.196, 0.0445], (1.226, 4.033], (0.0445, 1.226], ..., (-2.977, -1.196], (-1.196, 0.0445], (-1.196, 0.0445], (0.0445, 1.226], (0.0445, 1.226]]
Length: 1000
Categories (4, interval[float64]): [(-2.977, -1.196] < (-1.196, 0.0445] < (0.0445, 1.226] < (1.226, 4.033]]

In [543]:
data = DataFrame(np.random.randn(1000, 4))

In [544]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.048415    -0.019126    -0.027949     0.030666
std       0.995503     1.030145     0.985901     1.009055
min      -3.288026    -3.176944    -3.322958    -3.321610
25%      -0.610832    -0.654078    -0.710080    -0.667450
50%       0.050545    -0.047034    -0.012800    -0.006939
75%       0.701400     0.609922     0.647354     0.726846
max       3.497104     4.389230     2.735575     3.342530

In [545]:
col = data[2]

In [546]:
col[np.abs(col) > 3]

932   -3.322958
Name: 2, dtype: float64

In [547]:
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
15  -1.491806 -0.944629  0.537761  3.211790
57  -1.224683 -3.176944  0.523377  1.148293
95  -0.316738 -1.019566  0.181885  3.342530
212  0.194706  0.871980 -1.125042 -3.321610
293  0.047955  3.229445 -1.196387 -0.123123
..        ...       ...       ...       ...
640 -3.288026  0.144886  0.534234 -0.909427
695  1.276167  4.389230 -0.335974 -0.357821
778  3.497104 -0.582053 -0.635232  0.776878
854  0.531276  0.764928 -0.557970  3.162024
932 -0.752104 -0.055108 -3.322958  0.380545

[15 rows x 4 columns]

In [548]:
data[np.abs(data) > 3] = np.sign(data) * 3

In [549]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.048112    -0.021355    -0.027626     0.030515
std       0.992129     1.021312     0.984873     1.005063
min      -3.000000    -3.000000    -3.000000    -3.000000
25%      -0.610832    -0.654078    -0.710080    -0.667450
50%       0.050545    -0.047034    -0.012800    -0.006939
75%       0.701400     0.609922     0.647354     0.726846
max       3.000000     3.000000     2.735575     3.000000

In [550]:
np.sign(data).head()

     0    1    2    3
0  1.0 -1.0 -1.0  1.0
1 -1.0  1.0 -1.0 -1.0
2  1.0 -1.0  1.0 -1.0
3 -1.0 -1.0  1.0 -1.0
4 -1.0 -1.0  1.0 -1.0

In [551]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))

In [552]:
sampler = np.random.permutation(5)

In [553]:
sampler

array([2, 4, 1, 0, 3])

In [554]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [555]:
df.take(sampler)

    0   1   2   3
2   8   9  10  11
4  16  17  18  19
1   4   5   6   7
0   0   1   2   3
3  12  13  14  15

In [556]:
df.sample(n=3)

    0   1   2   3
0   0   1   2   3
2   8   9  10  11
4  16  17  18  19

In [557]:
choices = pd.Series([5, 7, -1, 6, 4])

In [558]:
draws = choices.sample(n=10, replace=True)

In [559]:
draws

1    7
1    7
2   -1
1    7
0    5
1    7
3    6
1    7
0    5
0    5
dtype: int64

In [560]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
                  'data1': range(6)})

In [561]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [563]:
dummies = pd.get_dummies(df['key'], prefix='key')

In [564]:
df_with_dummy = df[['data1']].join(dummies)

In [565]:
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [566]:
mnames = ['movie_id', 'title', 'genres']

In [568]:
movies = pd.read_table('/Users/karolkul/temp/pytand/dane/movielens/movies.dat', sep='::',
                      header=None, names=mnames)

<ipython-input-568-8c317da97f1c>:1: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  movies = pd.read_table('/Users/karolkul/temp/pytand/dane/movielens/movies.dat', sep='::',

In [569]:
movies[:10]

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

In [570]:
all_genres = []

In [571]:
for x in movies.genres:
    all_genres.extend(x.split('|'))

In [572]:
genres = pd.unique(all_genres)

In [573]:
genres

array(['Animation', "Children's", 'Comedy', 'Adventure', 'Fantasy',
       'Romance', 'Drama', 'Action', 'Crime', 'Thriller', 'Horror',
       'Sci-Fi', 'Documentary', 'War', 'Musical', 'Mystery', 'Film-Noir',
       'Western'], dtype=object)

In [574]:
zero_matrix = np.zeros((len(movies), len(genres)))

In [575]:
dummies = pd.DataFrame(zero_matrix, columns=genres)

In [576]:
gen = movies.genres[0]

In [577]:
gen.split('|')

['Animation', "Children's", 'Comedy']

In [578]:
dummies.columns.get_indexer(gen.split('|'))

array([0, 1, 2])

In [581]:
for i , gen in enumerate(movies.genres):
    indices = dummies.columns.get_indexer(gen.split('|'))
    dummies.iloc[i, indices] = 1

In [582]:
movies_windic = movies.join(dummies.add_prefix('Genre_'))

In [583]:
movies_windic

,movie_id,title,genres,Genre_Animation,Genre_Children's,Genre_Comedy,Genre_Adventure,Genre_Fantasy,Genre_Romance,Genre_Drama,...,Genre_Crime,Genre_Thriller,Genre_Horror,Genre_Sci-Fi,Genre_Documentary,Genre_War,Genre_Musical,Genre_Mystery,Genre_Film-Noir,Genre_Western
0,1,Toy Story (1995),Animation|Children's|Comedy,1.0,1.0,1.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,2,Jumanji (1995),Adventure|Children's|Fantasy,0.0,1.0,0.0,1.0,1.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,3,Grumpier Old Men (1995),Comedy|Romance,0.0,0.0,1.0,0.0,0.0,1.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,4,Waiting to Exhale (1995),Comedy|Drama,0.0,0.0,1.0,0.0,0.0,0.0,1.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,5,Father of the Bride Part II (1995),Comedy,0.0,0.0,1.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3878,3948,Meet the Parents (2000),Comedy,0.0,0.0,1.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3879,3949,Requiem for a Dream (2000),Drama,0.0,0.0,0.0,0.0,0.0,0.0,1.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3880,3950,Tigerland (2000),Drama,0.0,0.0,0.0,0.0,0.0,0.0,1.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3881,3951,Two Family House (2000),Drama,0.0,0.0,0.0,0.0,0.0,0.0,1.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3882,3952,"Contender, The (2000)",Drama|Thriller,0.0,0.0,0.0,0.0,0.0,0.0,1.0,...,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [584]:
np.random.seed(12345)

In [585]:
values = np.random.rand(10)

In [586]:
values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [587]:
pd.get_dummies(pd.cut(values, bins))

   (18, 25]  (25, 35]  (35, 60]  (60, 100]
0         0         0         0          0
1         0         0         0          0
2         0         0         0          0
3         0         0         0          0
4         0         0         0          0
5         0         0         0          0
6         0         0         0          0
7         0         0         0          0
8         0         0         0          0
9         0         0         0          0

In [588]:
val = 'a,b, guido'

In [589]:
val.split(',')

['a', 'b', ' guido']

In [590]:
pieces = [x.strip() for x in val.split(',')]

In [591]:
pieces

['a', 'b', 'guido']

In [592]:
first, second, third = pieces

In [593]:
first + '::' + second + '::' + third

'a::b::guido'

In [594]:
'::'.join(pieces)

'a::b::guido'

In [595]:
'guido' in val

True

In [596]:
val.index(',')

1

In [597]:
val.find(':')

-1

In [598]:
val.index(':')

ValueError: substring not found

In [600]:
val.count(',')

2

In [601]:
val.replace(',', '::')

'a::b:: guido'

In [603]:
val.replace(',', '')

'ab guido'

In [604]:
import re

In [605]:
text = "foo bar\tbaz  \tqux"

In [606]:
re.split('\s+', text)

['foo', 'bar', 'baz', 'qux']

In [607]:
regex = re.compile('\s+')

In [608]:
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [609]:
regex.findall(text)

[' ', '\t', '  \t']

In [613]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""
pattern =r'[A-Z0-9._+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'
regex = re.compile(pattern, flags=re.IGNORECASE)

In [614]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

m = regex.search(text)

In [615]:
m = regex.search(text)

In [616]:
m

In [617]:
text[m.start():m.end()]

'dave@google.com'

In [618]:
print(regex.match(text))

None

In [619]:
print(regex.sub('REDACTED', text))

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

In [620]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'

In [621]:
regex = re.compile(pattern, flags=re.IGNORECASE)

In [622]:
m = regex.match('wesm@bright.net')

In [623]:
m.groups()

('wesm', 'bright', 'net')

In [624]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [625]:
print(regex.sub(r'Username: \1, Domain: \2, Suffix: \3', text))

Dave Username: dave, Domain: google, Suffix: com
Steve Username: steve, Domain: gmail, Suffix: com
Rob Username: rob, Domain: gmail, Suffix: com
Ryan Username: ryan, Domain: yahoo, Suffix: com

In [626]:
data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com',
       'Rob': 'rob@gmail.com', 'Wes': np.nan}

In [627]:
data = pd.Series(data)

In [628]:
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [629]:
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool